stm32-rs/stm32f4xx-hal/src/gpio.rs
                    /// Configures the pin to operate as a pulled down input pin
                    pub fn into_pull_down_input(
                        self,
                    ) -> $PXi<Input<PullDown>> {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.moder.modify(|_, w| w.$moderi().input());
                        gpio.pupdr.modify(|_, w| w.$pupdri().pull_down());

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as a pulled up input pin
                    pub fn into_pull_up_input(
                        self,
                    ) -> $PXi<Input<PullUp>> {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.moder.modify(|_, w| w.$moderi().input());
                        gpio.pupdr.modify(|_, w| w.$pupdri().pull_up());

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as an open drain output pin
                    pub fn into_open_drain_output(
                        self,
                    ) -> $PXi<Output<OpenDrain>> {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.moder.modify(|_, w| w.$moderi().output());
                        gpio.pupdr.modify(|_, w| w.$pupdri().floating());
                        gpio.otyper.modify(|_, w| w.$oti().open_drain());

                        $PXi { _mode: PhantomData }
                    }

                    /// Configures the pin to operate as an push pull output pin
                    pub fn into_push_pull_output(
                        self,
                    ) -> $PXi<Output<PushPull>> {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.moder.modify(|_, w| w.$moderi().output());
                        gpio.pupdr.modify(|_, w| w.$pupdri().floating());
                        gpio.otyper.modify(|_, w| w.$oti().push_pull());

                        $PXi { _mode: PhantomData }
                    }

                    /// Set pin speed
                    pub fn set_speed(self, speed: Speed) -> Self {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.ospeedr.modify(|_, w| w.$ospeedri().bits(speed as u8));

                        self
                    }
                }

                impl $PXi<Output<OpenDrain>> {
                    /// Enables / disables the internal pull up
                    pub fn internal_pull_up(&mut self, on: bool) {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.pupdr.modify(|_, w|
                            if on { w.$pupdri().pull_up() }
                            else  { w.$pupdri().floating() }
                        );
                    }
                }

                impl<MODE> $PXi<Alternate<MODE>> {
                    /// Enables / disables the internal pull up
                    pub fn internal_pull_up(self, on: bool) -> Self {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.pupdr.modify(|_, w|
                            if on { w.$pupdri().pull_up() }
                            else  { w.$pupdri().floating() }
                        );

                        self
                    }
                }

                impl<MODE> $PXi<Alternate<MODE>> {
                    /// Turns pin alternate configuration pin into open drain
                    pub fn set_open_drain(self) -> Self {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        gpio.otyper.modify(|_, w| w.$oti().open_drain());

                        self
                    }
                }

                impl<MODE> $PXi<Output<MODE>> {
                    /// Erases the pin number from the type
                    ///
                    /// This is useful when you want to collect the pins into an array where you
                    /// need all the elements to have the same type
                    pub fn downgrade(self) -> $PXx<Output<MODE>> {
                        $PXx {
                            i: $i,
                            _mode: self._mode,
                        }
                    }
                }

                impl<MODE> OutputPin for $PXi<Output<MODE>> {
                    fn set_high(&mut self) {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        // NOTE(unsafe) atomic write to a stateless register
                        gpio.bsrr.write(|w| w.$bsi().set());
                    }

                    fn set_low(&mut self) {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        // NOTE(unsafe) atomic write to a stateless register
                        gpio.bsrr.write(|w| w.$bri().reset());
                    }
                }

                impl<MODE> InputPin for $PXi<Output<MODE>> {
                    fn is_high(&self) -> bool {
                        !self.is_low()
                    }

                    fn is_low(&self) -> bool {
                        let gpio = unsafe { &(*$GPIOX::ptr()) };
                        // NOTE(unsafe) atomic read with no side effects
                        gpio.idr.read().$idri().is_low()
                    }
                }

                impl<MODE> $PXi<Input<MODE>> {
                    /// Erases the pin number from the type
                    ///
                    /// This is useful when you want to collect the pins into an array where you
                    /// need all the elements to have the same type
                    pub fn downgrade(self) -> $PXx<Input<MODE>> {
                        $PXx {
                            i: $i,
                            _mode: self._mode,
                        }
                    }
                }

